{
  "backend/main.mo": "Motoko canister defining file upload and management logic with access control, storing audio/video files, tracking processing status, and enforcing owner/admin permissions for updates and queries.",
  "feature_evidence.json": "Feature evidence report documenting two UI accessibility and usability improvements to the UploadSection dropzone, including full-area click/tap support and keyboard accessibility, with affected files and components.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend source files, describing their responsibilities across app structure, hooks, UI components, styles, utilities, and backend typings.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens, OKLCH color palette, layout variables, and base styles for the application.",
  "frontend/index.html": "Base HTML entry point that defines metadata, page title, root div, and loads the React application bundle.",
  "frontend/src/App.tsx": "Root React component that wires up theme support, global layout (header, dashboard, footer), and notification toaster.",
  "frontend/src/components/Footer.tsx": "Footer UI component showing copyright, attribution to caffeine.ai with iconography, and a GitHub link.",
  "frontend/src/components/GenerationProgress.tsx": "Progress and status indicator for the content generation pipeline, displaying step-by-step states, errors, and contextual retry actions.",
  "frontend/src/components/Header.tsx": "Application header displaying branding and authentication controls, integrating Internet Identity login/logout and showing the user principal.",
  "frontend/src/components/HeroSection.tsx": "Marketing hero section for unauthenticated users with Hindi copy, feature cards, gradient background, and promotional imagery.",
  "frontend/src/components/UploadSection.tsx": "Implements the audio upload UI with drag-and-drop and file selection, orchestrating a multi-step generation flow (upload, placeholder creation, processing, status updates). Integrates backend mutations, progress tracking, error handling, and user toasts.",
  "frontend/src/components/VideoGallery.tsx": "Displays a gallery of generated video files with status badges, retry handling for failed videos, and selection to open a video player modal. Filters backend files to videos and manages simple regeneration simulation.",
  "frontend/src/components/VideoPlayer.tsx": "Renders a modal video player that fetches video bytes from the backend, creates a Blob URL for playback, and falls back to a placeholder on failure. Handles loading, error states, cleanup of object URLs, and download/regeneration UI.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook to create and manage the backend actor based on the current Internet Identity, including anonymous access and admin initialization. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines the Internet Identity authentication context and provider, managing login, logout, identity persistence, and status flags. Wraps Dfinity AuthClient setup and exposes a hook for accessing identity state.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for backend file operations, including listing user files, uploading files, updating file status, and fetching a single file. Coordinates with the actor lifecycle and auto-refetches during processing.",
  "frontend/src/index.css": "Sets up Tailwind base/components/utilities, defines extensive CSS variables for light and dark themes using OKLCH colors, and adds global styles plus a gradient animation utility.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app, wiring React Query and Internet Identity providers around the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Auth-gated dashboard page that shows a hero and login CTA when logged out, loading spinners during initialization, and upload/gallery UI when authenticated.",
  "frontend/src/utils/errors.ts": "Provides a normalizeError utility that maps various error shapes and backend messages into user-friendly English strings.",
  "frontend/src/utils/placeholderVideo.ts": "Loads and validates a static MP4 placeholder video asset, ensuring minimum size and MP4 signature before returning its bytes for upload.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query or hash routing, persisting them in sessionStorage, and managing their lifecycle.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, extended theme colors tied to CSS variables, animations, and plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current scope, goals, and implemented features, including authentication, file handling, and dashboard behavior."
}