{
  "backend/main.mo": "Motoko canister managing user-uploaded audio/video files with access control, storing file metadata, status, and blobs, and exposing APIs to upload files, update processing status, and query files by user or ID.",
  "feature_evidence.json": "Structured report describing implemented product features, their associated frontend files, dependencies, test requirements, and confidence levels for video placeholder, playback, gallery, and UI text improvements.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend source files, documenting component responsibilities, hooks, utilities, styles, and backend type definitions.",
  "frontend/index.css": "Global Tailwind CSS setup defining a bright cartoon-themed design system using CSS variables for light and dark modes, including colors, radius, and layout primitives.",
  "frontend/index.html": "Base HTML entry point that defines the root container and loads the React application bundle.",
  "frontend/src/App.tsx": "Root React component that wires up theming, layout structure, header, dashboard, footer, and global toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer UI component showing copyright, caffeine.ai attribution with heart icon, and a GitHub link.",
  "frontend/src/components/GenerationProgress.tsx": "Progress indicator component that visualizes multi-step generation workflow with status icons, progress bar, English error handling, and contextual retry actions.",
  "frontend/src/components/Header.tsx": "Application header displaying branding, logo, and authentication controls using Internet Identity, including login/logout and principal preview.",
  "frontend/src/components/HeroSection.tsx": "Renders a marketing hero section with a gradient background, Hindi headline/description, feature cards, and a banner image. Includes a small FeatureCard subcomponent for icon/title/description blocks.",
  "frontend/src/components/UploadSection.tsx": "Implements audio upload via drag-and-drop or file picker, manages multi-step generation state, and uploads audio to the backend actor with progress tracking. Handles placeholder video creation, status updates, retries, and user feedback via toasts.",
  "frontend/src/components/VideoGallery.tsx": "Displays a gallery of generated video files with status badges and retry support for failed videos. Opens a VideoPlayer modal when a video card is selected and handles empty states.",
  "frontend/src/components/VideoPlayer.tsx": "Modal video player that fetches video bytes from the backend, creates a Blob URL for playback, and falls back to a placeholder video on errors. Manages loading, error states, cleanup of object URLs, and user actions like download or regenerate.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, supporting anonymous access and admin token initialization. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for Internet Identity authentication, including login, logout, and status tracking. Wraps AuthClient setup, identity persistence, and exposes identity state to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch user files, upload files, update file status, and fetch a single file via a backend actor, with polling while files are processing and cache invalidation on mutations.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and extensive OKLCH color variables for light and dark themes, plus a gradient animation utility.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the app with React Query and Internet Identity providers, importing global styles.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that handles login state, shows a hero/login prompt for unauthenticated users, and displays upload controls and a video gallery for authenticated users.",
  "frontend/src/utils/errors.ts": "Utility to normalize various error shapes into consistent, user-friendly error messages, with specific mappings for common backend and auth errors.",
  "frontend/src/utils/placeholderVideo.ts": "Loads and validates a placeholder MP4 video asset, ensuring minimum size and correct MP4 signature before returning bytes for upload.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query strings or hash routes, persisting them in sessionStorage, and managing stored parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom color tokens mapped to CSS variables, animations, and plugins.",
  "project_state.json": "Defines the current project state for AutoToon Studio, including schema/versioning, high-level product goals, and a detailed summary of implemented features. It enumerates existing frontend/backend capabilities such as authentication, actor management, file upload, processing status, polling, and auth-gated dashboard UX."
}