{
  "kind": "build_request",
  "title": "Fix upload dropzone click/tap to open file picker on mobile + desktop",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the audio UploadSection drag-and-drop area so the entire dropzone is fully clickable/tappable on both mobile and desktop to open the file picker (not only the \"Select File\" button). Ensure the click/tap triggers the underlying <input type=\"file\"> reliably on mobile Chrome.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Ye button hi kaam nahi kar raha , click karne par kuch nahi ho raha",
          "1- pura box",
          "3-mobile user hu",
          "1-doni ke liye fix karo",
          "Confirm"
        ]
      },
      "acceptanceCriteria": [
        "On mobile Chrome, tapping anywhere inside the upload dropzone opens the native file picker when the user is logged in and the app is not processing.",
        "On desktop Chrome, clicking anywhere inside the upload dropzone opens the file picker when not disabled.",
        "Drag-and-drop still works as before for desktop users (drop uploads start).",
        "When the upload UI is disabled (processing/initializing/not logged in), the dropzone does not open the file picker and remains visibly disabled."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve the upload dropzone hit-area and accessibility: show a clear pointer/interactive affordance when enabled, and support keyboard activation (Enter/Space) for the dropzone to open the file picker.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Thoda capacity kam hua he button ka"
        ]
      },
      "acceptanceCriteria": [
        "When enabled, the dropzone visually indicates interactivity (e.g., cursor pointer on desktop).",
        "When the dropzone is focused, pressing Enter or Space opens the file picker.",
        "No regression to existing upload flow, progress UI, or toast messaging."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep the backend architecture single-actor; no backend changes are required for this UI interaction fix."
  ],
  "nonGoals": [
    "Do not implement new backend upload APIs or change backend storage behavior.",
    "Do not address unrelated known issues (e.g., fileId collisions, hash normalization errors, \"Actor not initialized\", gallery thumbnails) unless directly required to fix the click/tap-to-open file picker regression."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}