{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make upload dropzone fully clickable/tappable with reliable mobile file picker activation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the entire UploadSection dropzone open the file picker reliably on mobile/desktop while preserving drag-and-drop and respecting disabled states.",
      "acceptanceCriteria": [
        "On mobile Chrome, tapping anywhere inside the upload dropzone opens the native file picker when the user is logged in and the app is not processing.",
        "On desktop Chrome, clicking anywhere inside the upload dropzone opens the file picker when not disabled.",
        "Drag-and-drop still works as before for desktop users (drop uploads start).",
        "When the upload UI is disabled (processing/initializing/not logged in), the dropzone does not open the file picker and remains visibly disabled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UploadSection.tsx",
          "operation": "modify",
          "description": "Refactor the dropzone so the full area triggers the underlying file input via a reliable, user-gesture-friendly pattern (e.g., label/htmlFor + non-display-none input or an input overlay) that works on mobile Chrome; ensure the trigger is gated by the existing disabled state (processing/initializing/not logged in) and keep existing drag-and-drop handlers working for desktop."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve dropzone hit-area affordance and accessibility with pointer/interactive styling and keyboard activation to open the file picker.",
      "acceptanceCriteria": [
        "When enabled, the dropzone visually indicates interactivity (e.g., cursor pointer on desktop).",
        "When the dropzone is focused, pressing Enter or Space opens the file picker.",
        "No regression to existing upload flow, progress UI, or toast messaging."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UploadSection.tsx",
          "operation": "modify",
          "description": "Add accessible interactive semantics to the dropzone (focusability, role/aria-disabled as appropriate) and implement keyboard activation (Enter/Space) to open the file picker only when enabled; add clear enabled/disabled affordances (e.g., cursor-pointer when enabled, focus-visible ring styling) without changing existing upload/progress/toast behavior."
        }
      ]
    }
  ]
}